In [1]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (0.3.9)
Requirement already satisfied: prettytable in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython>=1.0 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython-sql) (9.5.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython-sql) (1.4.51)
Requirement already satisfied: sqlparse in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython-sql) (0.5.2)
Requirement already satisfied: six in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (1.1.1)
Requirement already satisfied: jedi>=0.16 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from ipython>=1.0->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from prompt_toolkit<3.1.0,>=3.0.41->ipython>=1.0->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.4)
Requirement already satisfied: greenlet!=0.4.17 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (3.2.4)
Requirement already satisfied: executing>=1.2.0 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from stack_data->ipython>=1.0->ipython-sql) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from stack_data->ipython>=1.0->ipython-sql) (3.0.0)
Requirement already satisfied: pure_eval in c:\programdata\anaconda3\envs\sql_packages\lib\site-packages (from stack_data->ipython>=1.0->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

In [1]:
%load_ext sql

In [5]:
%sql sqlite:///chinook.db

'Connected: @chinook.db'

In [6]:
%%sql

SELECT FirstName
FROM customers
LIMIT 10;

   sqlite:///C:/Users/Admin/OneDrive/Desktop/ALX
 * sqlite:///chinook.db
Done.

[('Luís',),
 ('Leonie',),
 ('François',),
 ('Bjørn',),
 ('František',),
 ('Helena',),
 ('Astrid',),
 ('Daan',),
 ('Kara',),
 ('Eduardo',)]

In [7]:
%%sql

SELECT FirstName, LastName, HireDate
FROM employees;

   sqlite:///C:/Users/Admin/OneDrive/Desktop/ALX
 * sqlite:///chinook.db
Done.

[('Andrew', 'Adams', '2002-08-14 00:00:00'),
 ('Nancy', 'Edwards', '2002-05-01 00:00:00'),
 ('Jane', 'Peacock', '2002-04-01 00:00:00'),
 ('Margaret', 'Park', '2003-05-03 00:00:00'),
 ('Steve', 'Johnson', '2003-10-17 00:00:00'),
 ('Michael', 'Mitchell', '2003-10-17 00:00:00'),
 ('Robert', 'King', '2004-01-02 00:00:00'),
 ('Laura', 'Callahan', '2004-03-04 00:00:00')]

In [8]:
%%sql

SELECT albums.Title, artists.Name
FROM albums, artists
LIMIT 10;

   sqlite:///C:/Users/Admin/OneDrive/Desktop/ALX
 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('For Those About To Rock We Salute You', 'Accept'),
 ('For Those About To Rock We Salute You', 'Aerosmith'),
 ('For Those About To Rock We Salute You', 'Alanis Morissette'),
 ('For Those About To Rock We Salute You', 'Alice In Chains'),
 ('For Those About To Rock We Salute You', 'Antônio Carlos Jobim'),
 ('For Those About To Rock We Salute You', 'Apocalyptica'),
 ('For Those About To Rock We Salute You', 'Audioslave'),
 ('For Those About To Rock We Salute You', 'BackBeat'),
 ('For Those About To Rock We Salute You', 'Billy Cobham')]

In [9]:
%%sql

SELECT albums.Title, artists.Name
FROM albums, artists
WHERE artists.Artistid = albums.Artistid
LIMIT 10;

   sqlite:///C:/Users/Admin/OneDrive/Desktop/ALX
 * sqlite:///chinook.db
Done.

[('For Those About To Rock We Salute You', 'AC/DC'),
 ('Balls to the Wall', 'Accept'),
 ('Restless and Wild', 'Accept'),
 ('Let There Be Rock', 'AC/DC'),
 ('Big Ones', 'Aerosmith'),
 ('Jagged Little Pill', 'Alanis Morissette'),
 ('Facelift', 'Alice In Chains'),
 ('Warner 25 Anos', 'Antônio Carlos Jobim'),
 ('Plays Metallica By Four Cellos', 'Apocalyptica'),
 ('Audioslave', 'Audioslave')]